% Να γράψετε πρόγραμμα σε Prolog το οποίο να βρίσκει εάν δυο κορυφές σ’ ένα
% κατευθυνόμενο μη κυκλικό γράφημα είναι συνδεδεμένες. Να κάνετε τα εξής:
% α. Να αναπαραστήσετε σε Prolog το κατευθυνόμενο γράφημα του σχήματος, Σχήμα1.
% β. Να γράψετε κατηγόρημα connected(A, B) το οποίο επιστρέφει true εάν η κορυφή Α,
% είναι συνδεδεμένη με την κορυφή Β, σε ένα κατευθυνόμενο μη κυκλικό γράφημα
% όπως αυτό της ερώτησης α. Μπορείτε να θεωρήσετε ότι κάθε κορυφή, π.χ. a, b, είναι
% συνδεδεμένη με τον εαυτό της. Δηλαδή, ερωτήσεις της μορφής «?- connected(a,a).»
% είναι αληθείς. Σημείωση: Το πρόγραμμα σας πρέπει να τρέχει για οποιοδήποτε
% κατευθυνόμενο γράφημα
edge(a, b).
edge(a, d).
edge(b, c).
edge(b, e).
edge(c, d).
edge(d, e).

connected(A, B) :-
    (   edge(A, X),
        connected(X, B)
    ;   A==B
    ).