pateras(kostas,anna).
pateras(kostas,aris).
antras(kostas,soula).
filo_aren(kostas).
filo_aren(aris).
filo_thiliko(soula).
filo_thiliko(anna).

% Εάν ο X είναι ο άντρας της Y τότε η Y είναι η γυναίκα του X.
ginaika(Y,X):- antras(X,Y).
% Εάν ο Χ είναι πατέρας του/της Υ τότε ο/η Υ είναι παιδί του Χ.
paidi(Y,X):- pateras(X,Y).
% Εάν ο Χ είναι πατέρας του/της Υ και η Ζ είναι γυναίκα του Χ τότε η Ζ είναι μητέρα
% του/της Υ.
mitera(Z,Y):- pateras(X,Y),ginaika(Z,X).
% Εάν η Χ είναι μητέρα του/της Υ τότε ο/η Υ είναι παιδί της Χ.
paidi(Y,X):- mitera(X,Y).
% Εάν ο Χ είναι πατέρας του Y και ο Χ είναι πατέρας του/της Ζ και ο Υ είναι φύλου
% αρσενικού και ο Υ είναι διαφορετική οντότητα από τον/την Ζ τότε o Y είναι
% αδελφός του/της Ζ. 
adelfos(Y,Z):- pateras(X,Y), pateras(X,Z),filo_aren(Y),Y \= Z.
% Εάν η Χ είναι μητέρα του Y και η Χ είναι μητέρα του/της Ζ και ο Υ είναι φύλου
% αρσενικού και ο Υ είναι διαφορετική οντότητα από τον/την Ζ τότε o Y είναι
% αδελφός του/της Ζ. 
adelfos(Y,Z):- mitera(X,Y), mitera(X,Z), filo_aren(Y), Y \= Z.
% Εάν ο Χ είναι πατέρας της Y και ο Χ είναι πατέρας του/της Ζ και η Υ είναι φύλου
% θηλυκού και η Υ είναι διαφορετική οντότητα από τον/την Ζ τότε η Y είναι αδελφή
% του/της Ζ. 
adelfi(Y,Z):- pateras(X,Y), pateras(X,Z), filo_thiliko(Y),Y \= Z.
% Εάν η Χ είναι μητέρα της Y και η Χ είναι μητέρα του/της Ζ και η Υ είναι φύλου
% θηλυκού και η Υ είναι διαφορετική οντότητα από τον/την Ζ τότε η Y είναι αδελφή
% του/της Ζ.
adelfi(Y,Z):- mitera(X,Y), mitera(X,Z), filo_thiliko(Y), Y \= Z.
