% Άσκηση 2
% Να γράψετε κατηγόρημα mkd(X, Y, Z) το οποίο είναι αληθές εάν ο Ζ είναι ο μέγιστος
% κοινός διαιρέτης (ΜΚΔ) των Χ και Υ όπου Χ και Υ είναι ακέραιοι αριθμοί. Για τον
% υπολογισμό του ΜΚΔ να διακρίνετε τις εξής περιπτώσεις:
% α. Εάν τα Χ και Υ είναι ίσα τότε ο ΜΚΔ είναι ίσος είτε με το Χ ή με το Υ.
% β. Εάν Χ<Υ τότε ο ΜΚΔ είναι αυτός που προκύπτει από το Χ και το Υ–Χ. Δηλαδή
% στην αναδρομική κλήση το Υ πρέπει να αντικατασταθεί από το Υ–Χ.
% γ. Εάν Υ<Χ τότε ισχύει η περίπτωση β αλλά με αντικατάσταση του Χ από Χ–Υ.
% Να χρησιμοποιήσετε αποκοπή στις προτάσεις του προγράμματός σας όπου χρειάζεται.
mkd(X, Y, Z) :-
    X=:=Y,
    Z is Y,
    !.
mkd(X, Y, Z) :-
    X<Y,
    X1 is Y-X,
    mkd(X, X1, Z).
mkd(X, Y, Z) :-
    X>=Y,
    X1 is X-Y,
    mkd(X1, Y, Z).
