% Άσκηση 4
% Θεωρήσατε το παρακάτω πρόγραμμα Prolog. Να φτιάξετε τη γραφική αναπαράσταση
% της δομής του προγράμματος χρησιμοποιώντας το μοντέλο ελέγχου ροής «κιβώτιο
% διαδικασίας ή κιβώτιο Byrd». Να κάνετε την ανίχνευση της εκτέλεσης του
% προγράμματός μέσω των θυρών του μοντέλου για τους στόχους «?-p(a)», «?-p(b)», «?-
% p(c)». Στην ανίχνευση της εκτέλεσης κάθε στόχου να δείχνετε που γίνεται
% οπισθοδρόμηση. Να συγκρίνετε τα αποτελέσματα της ανίχνευσης.

p(b).
p(X) :- q(X, Y), r(Y).
q(c, b).
q(a, a).
r(b).
r(a).