% Άσκηση 1
% Γράψετε υποπρογράμματα για τα κατηγορήματα member/2, adjacent/3 και last/2
% χρησιμοποιώντας τα κατηγόρημα append/3.
% α) Το κατηγόρημα member(X, L) είναι αληθές εάν το στοιχείο Χ είναι στοιχείο της
% λίστας L.
% β) Το κατηγόρημα adjacent(X, Υ, L) είναι αληθές εάν τα στοιχεία Χ και Υ είναι
% γειτονικά στην λίστας L.
% γ) Το κατηγόρημα last(X, L) είναι αληθές εάν το στοιχείο Χ είναι τελευταίο στοιχείο
% της λίστας L.
member(X, L) :-
    append(_, [X|_], L).

adjacent(X, Y, L) :-
    append(_, [X, Y|_], L).

last(X, L) :-
    append(_, [X], L).